Autodesk.Revit.DB.BuiltInFailures.ViewPositionFailures.ViewAnchorDoesNotSupportView
The View Anchor ""%1!s!"" is not supported by view ""%2!s!"".

Autodesk.Revit.DB.BuiltInFailures.ViewPositionFailures.CropRequiredAlignment
Can't move Viewport when its placement is controlled by the assigned View Position.

Autodesk.Revit.DB.BuiltInFailures.ViewPositionFailures.CannotMoveViewportWarn
Can't move Viewport when its placement is controlled by the assigned View Position.

Autodesk.Revit.DB.BuiltInFailures.ViewPositionFailures.CannotMoveViewportError
Can't move Viewport when its placement is controlled by the assigned View Position.

Autodesk.Revit.DB.BuiltInFailures.ViewPositionFailures
Failures about Viewport Positions.